{
  "home": "Home",
  "about": "About",
  "articles": "Articles",
  "projects": "Projects",
  "share": "Share",
  "letsBuild": "Let's build",
  "something": "Something",
  "together": "Together",
  "copy": "Copy this link to your clipboard",
  "emailArticle": "Email this article",
  "fbArticle": "Share this article in a Facebook post",
  "xArticle": "Share this article via X post",
  "linkedinArticle": "Share this article via LinkedIn post",
  "contact": "Contact",
  "contactUs": "Contact us",
  "readMore": "Read more",
  "hangOutDevs": "Hang out for a beer with devs in",
  "hangOutDevsLocation": "Madrid, Spain",
  "hangOutDesigner": "Drink coffee with designer in",
  "hangOutDesignerLocation": " Kielce, Poland",
  "fullName": "Full name",
  "email": "E-mail",
  "message": "Message",
  "send": "Send",
  "sended": "Sended",
  "iconMenuAlt": "Open navegation panel",
  "iconCloseAlt": "Close navegation panel",
  "ourProjects": "Our Projects",
  "projectCTA": "Each project in our repertoire tells a story of innovation and perseverance. Welcome to a world where every project is a step forward in our mission to redefine the boundaries of what is possible in the digital world.",
  "deployedWebsite": "Deployed website",
  "otherProjects": "Other Projects",
  "visit": "Visit",
  "iconLogoAlt": "Coding Flavour logo",
  "seeMore": "See more",
  "weMake": "We make",
  "development": "Development",
  "frontEnd": "Front End",
  "backEnd": "Back End",
  "design": "Design",
  "creativeTeam": "Creative team",
  "aboutTheTeamHeading": "About the team. How it started?",
  "aboutTheTeamDescriptionOne": "Each of us brings a unique story and special skills to the table, our diversity is our greatest strength. We are not defined by titles, but by our ideas and abilities to turn them into reality. Each member of our team is a technological artist, a tireless creator, and we are united by our shared passion for innovation. Here, creativity is the currency and the possibilities are endless.",
  "aboutTheTeamDescriptionTwo": "Imagine a spark in the dark: that's what our initial idea was. From that spark, we have ignited a digital revolution. Coding Flavour was born out of a desire to challenge the norms, to find new ways of doing things. Every project we undertake is a chapter in our story, where barriers are broken and innovative solutions find a home.",
  "growth": "Growth",
  "growthDescription": "Commitment to continuous learning, development, and advancement for both our team and our solutions.",
  "creativity": "Creativity",
  "creativityDescription": "We thrive on thinking beyond the conventional, embracing fresh perspectives and imaginative solutions.",
  "boldness": "Boldness",
  "boldnessDescription": "Drives us to pioneer innovative solutions and overcome challenges with unwavering determination.",
  "responsibility": "Responsibility",
  "responsibilityDescription": "We understand the impact of our work on the world. We prioritize well-being of individuals and environment.",
  "community": "Community",
  "communityDescription": "Fostered through collaboration, knowledge-sharing, and mutual support, creating an ecosystem to drive collective growth.",
  "ourValues": "Our values",
  "heroPageOne": "We don't just create software, we create solutions.",
  "heroPageTwo": "Striving to challenge the limits of innovation, fusing elegance of design with seamless functionality. In a world where every byte counts, it is our passion to perfect every algorithm and polish every interface.",
  "heroPageThree": "Your vision is our map, and every project is an opportunity to reinvent the possible."
}
