{
  "home": "Inicio",
  "about": "Acerca",
  "articles": "Artículos",
  "projects": "Proyectos",
  "share": "Compartir",
  "letsBuild": "Construyamos",
  "something": "Algo",
  "together": "Juntos",
  "copy": "Copia este vínculo a tu portapapeles",
  "emailArticle": "Envía este artículo por correo electrónico",
  "fbArticle": "Comparte este artículo a través de Facebook",
  "xArticle": "Comparte este artículo a través de X",
  "linkedinArticle": "Comparte este artículo a través de LinkedIn",
  "contact": "Contacto",
  "contactUs": "Contáctanos",
  "readMore": "Leer más",
  "hangOutDevs": "Queda para una cerveza con nuestros desarrolladores en",
  "hangOutDevsLocation": "Madrid, España",
  "hangOutDesigner": "Tómate un café con nuestros diseñadores en",
  "hangOutDesignerLocation": "Kielce, Polonia",
  "fullName": "Nombre completo",
  "email": "Correo electrónico",
  "message": "Mensaje",
  "send": "Enviar",
  "sended": "Enviado",
  "iconMenuAlt": "Abrir panel de navegación",
  "iconCloseAlt": "Cerrar panel de navegación",
  "ourProjects": "Nuestros proyectos",
  "projectCTA": "Cada proyecto en nuestro repertorio narra una historia de innovación y perseverancia. Bienvenidos a un mundo donde cada proyecto es un paso adelante en nuestra misión de redefinir los límites de lo posible en el mundo digital.",
  "deployedWebsite": "Web en vivo",
  "otherProjects": "Otros proyectos",
  "visit": "Visita",
  "iconLogoAlt": "Logo de Coding Flavour",
  "seeMore": "Ver más",
  "weMake": "Hacemos",
  "development": "Desarrollos",
  "frontEnd": "Front End",
  "backEnd": "Back End",
  "design": "Diseño",
  "creativeTeam": "Equipo creativo",
  "aboutTheTeamHeading": "Acerca del equipo. ¿Cómo empezamos?",
  "aboutTheTeamDescriptionOne": "Cada uno de nosotros aporta una historia única y habilidades especiales a la mesa, nuestra diversidad es nuestra mayor fortaleza. No nos definimos por títulos, sino por nuestras ideas y la capacidad de convertirlas en realidad. Cada miembro de nuestro equipo es un artista tecnológico, un creador incansable, y estamos unidos por nuestra pasión compartida por la innovación. Aquí, la creatividad es la moneda y las posibilidades son infinitas.",
  "aboutTheTeamDescriptionTwo": "Imagina una chispa en la oscuridad: eso es lo que fue nuestra idea inicial. A partir de esa chispa, hemos encendido una revolución digital. Coding Flavour nació de un deseo de desafiar las normas, de encontrar nuevas formas de hacer las cosas. Cada proyecto que emprendemos es un capítulo en nuestra historia, donde se rompen barreras y las soluciones innovadoras encuentran un hogar.",
  "growth": "Crecer",
  "growthDescription": "Compromiso con el aprendizaje, desarrollo y avance continuo tanto de nuestro equipo como de nuestras soluciones.",
  "creativity": "Creatividad",
  "creativityDescription": "Prosperamos pensando más allá de lo convencional, adoptando nuevas perspectivas y soluciones imaginativas.",
  "boldness": "Audacia",
  "boldnessDescription": "Nos impulsa a ser pioneros en soluciones innovadoras y superar desafíos con determinación inquebrantable.",
  "responsibility": "Responsabilidad",
  "responsibilityDescription": "Entendemos el impacto de nuestro trabajo en el mundo. Priorizamos el bienestar de las personas y el medio ambiente.",
  "community": "Comunidad",
  "communityDescription": "Fomentado a través de la colaboración, el intercambio de conocimientos y el apoyo mutuo, creando un ecosistema para impulsar el crecimiento colectivo.",
  "ourValues": "Nuestros valores",
  "heroPageOne": "No solo creamos software, creamos soluciones.",
  "heroPageTwo": "Buscamos desafiar los límites de la innovación, fusionando la elegancia del diseño con una funcionalidad impecable. En un mundo donde cada byte cuenta, nuestra pasión es perfeccionar cada algoritmo y pulir cada interfaz.",
  "heroPageThree": "Tu visión es nuestro mapa y cada proyecto es una oportunidad para reinventar lo posible.",
  "scrollAlt": "Puedes desplazarte hacia abajo para ver más."
}
